Revit 2026 API

# TableCellStyle Methods

---

The TableCellStyle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCellStyleOverrideOptions | Gets cell style override options of this cell. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ResetOverride | Resets any overrides applied to this cell. |
|  | SetCellStyleOverrideOptions | Sets cell style override options of this cell. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

TableCellStyle Class

Autodesk.Revit.DB Namespace